In [11]:
import pandas as pd
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [15]:
emp=pd.Series(['Uma','Siva','Sindhu','Ravi'])
id=pd.Series([10,20,30,40])
frame={'Emp':emp,'ID':id}
result=pd.DataFrame(frame)
print("\n Series to data frame\n")
print(result)

 Series to data frame

      Emp  ID
0     Uma  10
1    Siva  20
2  Sindhu  30
3    Ravi  40

In [19]:
print("\n Extracting One Column \n")
print(result['ID'])

 Extracting One Column

0    10
1    20
2    30
3    40
Name: ID, dtype: int64

In [21]:
result['Age']=pd.Series([20,25,30,50])
print(result)

      Emp  ID  Age
0     Uma  10   20
1    Siva  20   25
2  Sindhu  30   30
3    Ravi  40   50

In [29]:
print("Extracting the Second Row \n")
print(result.loc[1])

Extracting the Second Row

Emp    Siva
ID       20
Name: 1, dtype: object

In [31]:
#slicing:
print("slice rows\n")
result[1:3]

slice rows

      Emp  ID
1    Siva  20
2  Sindhu  30

In [43]:
#concatination:
a2=pd.DataFrame([['Anu',20],['Joe',19]],columns=['Emp','ID'])
print("\nAdding new row values\n",pd.concat([result,a2]))

Adding new row values
       Emp  ID
0     Uma  10
1    Siva  20
2  Sindhu  30
3    Ravi  40
0     Anu  20
1     Joe  19

In [49]:
print(result.drop(1))

      Emp  ID
0     Uma  10
2  Sindhu  30
3    Ravi  40